{
  "command_name": {
    "main_command": "file",
    "subcommand": null
  },
  "description": "file — determine\n    file type",
  "flags": [
    {
      "aliases": [
        "--apple"
      ],
      "description": "Causes the file command to output the file type and creator code as used by older MacOS versions. The code consists of eight letters, the first describing the file type, the latter the creator. This option works properly only for file formats that have the apple-style output defined.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-b",
        "--brief"
      ],
      "description": "Do not prepend filenames to output lines (brief mode).",
      "takes_argument": false
    },
    {
      "aliases": [
        "-C",
        "--compile"
      ],
      "description": "Write a magic.mgc output file that contains a pre-parsed version of the magic file or directory.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-c",
        "--checking-printout"
      ],
      "description": "Cause a checking printout of the parsed form of the magic file. This is usually used in conjunction with the -m option to debug a new magic file before installing it.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-d"
      ],
      "description": "Prints internal debugging information to stderr.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-E"
      ],
      "description": "On filesystem errors (file not found etc), instead of handling the error as regular output as POSIX mandates and keep going, issue an error message and exit.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-e",
        "--exclude"
      ],
      "description": "Exclude the test named in testname from the list of tests made to determine the file type. Valid test names are:",
      "takes_argument": true
    },
    {
      "aliases": [
        "--exclude-quiet"
      ],
      "description": "Like --exclude but ignore tests that file does not know about. This is intended for compatibility with older versions of file .",
      "takes_argument": false
    },
    {
      "aliases": [
        "--extension"
      ],
      "description": "Print a slash-separated list of valid extensions for the file type found.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-F",
        "--separator"
      ],
      "description": "Use the specified string as the separator between the filename and the file result returned. Defaults to ‘:’.",
      "takes_argument": true
    },
    {
      "aliases": [
        "-f",
        "--files-from"
      ],
      "description": "Read the names of the files to be examined from namefile (one per line) before the argument list. Either namefile or at least one filename argument must be present; to test the standard input, use ‘-’ as a filename argument. Please note that namefile is unwrapped and the enclosed filenames are processed when this option is encountered and before any further options processing is done. This allows one to process multiple lists of files with different command line arguments on the same file",
      "takes_argument": true
    },
    {
      "aliases": [
        "-h",
        "--no-dereference"
      ],
      "description": "This option causes symlinks not to be followed (on systems that support symbolic links). This is the default if the environment variable POSIXLY_CORRECT is not defined.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-i",
        "--mime"
      ],
      "description": "Causes the file command to output mime type strings rather than the more traditional human readable ones. Thus it may say ‘text/plain; charset=us-ascii’ rather than “ASCII text”.",
      "takes_argument": false
    },
    {
      "aliases": [
        "--mime-type",
        "--mime-encoding"
      ],
      "description": "Like -i , but print only the specified element(s).",
      "takes_argument": false
    },
    {
      "aliases": [
        "-k",
        "--keep-going"
      ],
      "description": "Don't stop at the first match, keep going. Subsequent matches will be have the string ‘\\012- ’ prepended. (If you want a newline, see the -r option.) The magic pattern with the highest strength (see the -l option) comes first.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-l",
        "--list"
      ],
      "description": "Shows a list of patterns and their strength sorted descending by magic(5) strength which is used for the matching (see also the -k option).",
      "takes_argument": false
    },
    {
      "aliases": [
        "-L",
        "--dereference"
      ],
      "description": "This option causes symlinks to be followed, as the like-named option in ls(1) (on systems that support symbolic links). This is the default if the environment variable POSIXLY_CORRECT is defined.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-m",
        "--magic-file"
      ],
      "description": "Specify an alternate list of files and directories containing magic. This can be a single item, or a colon-separated list. If a compiled magic file is found alongside a file or directory, it will be used instead.",
      "takes_argument": true
    },
    {
      "aliases": [
        "-N",
        "--no-pad"
      ],
      "description": "Don't pad filenames so that they align in the output.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-n",
        "--no-buffer"
      ],
      "description": "Force stdout to be flushed after checking each file. This is only useful if checking a list of files. It is intended to be used by programs that want filetype output from a pipe.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-p",
        "--preserve-date"
      ],
      "description": "On systems that support utime(3) or utimes(2) , attempt to preserve the access time of files analyzed, to pretend that file never read them.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-P",
        "--parameter"
      ],
      "description": "Set various parameter limits. Name Default Explanation bytes 1048576 max number of bytes to read from file elf_notes 256 max ELF notes processed elf_phnum 2048 max ELF program sections processed elf_shnum 32768 max ELF sections processed encoding 65536 max number of bytes to scan for encoding evaluation indir 50 recursion limit for indirect magic name 50 use count limit for name/use magic regex 8192 length limit for regex searches ",
      "takes_argument": true
    },
    {
      "aliases": [
        "-r",
        "--raw"
      ],
      "description": "Don't translate unprintable characters to \\ooo. Normally file translates unprintable characters to their octal representation.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-s",
        "--special-files"
      ],
      "description": "Normally, file only attempts to read and determine the type of argument files which stat(2) reports are ordinary files. This prevents problems, because reading special files may have peculiar consequences. Specifying the -s option causes file to also read argument files which are block or character special files. This is useful for determining the filesystem types of the data in raw disk partitions, which are block special files. This option also causes file",
      "takes_argument": false
    },
    {
      "aliases": [
        "-S",
        "--no-sandbox"
      ],
      "description": "On systems where libseccomp ( https://github.com/seccomp/libseccomp ) is available, the -S option disables sandboxing which is enabled by default. This option is needed for file to execute external decompressing programs, i.e. when the -z option is specified and the built-in decompressors are not available. On systems where sandboxing is not available, this option has no effect. Note: This Debian version of file was built without seccomp support, so this option has no effect. ",
      "takes_argument": false
    },
    {
      "aliases": [
        "-v",
        "--version"
      ],
      "description": "Print the version of the program and exit.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-z",
        "--uncompress"
      ],
      "description": "Try to look inside compressed files.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-Z",
        "--uncompress-noreport"
      ],
      "description": "Try to look inside compressed files, but report information about the contents only not the compression.",
      "takes_argument": false
    },
    {
      "aliases": [
        "-0",
        "--print0"
      ],
      "description": "Output a null character ‘\\0’ after the end of the filename. Nice to cut(1) the output. This does not affect the separator, which is still printed. If this option is repeated more than once, then file prints just the filename followed by a NUL followed by the description (or ERROR: text) followed by a second NUL for each entry. ",
      "takes_argument": false
    },
    {
      "aliases": [
        "--help"
      ],
      "description": "Print a help message and exit.",
      "takes_argument": false
    }
  ],
  "positional_arguments": [
    {
      "name": "file",
      "type": "REPEATED"
    }
  ]
}